## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # module.fatp_azure_web_app_services_hosting.data.azurerm_storage_account_blob_container_sas.logs["app"] will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_storage_account_blob_container_sas" "logs" {
      + connection_string = (sensitive value)
      + container_name    = "find-a-tp-pr-398applogs"
      + expiry            = (known after apply)
      + https_only        = true
      + id                = (known after apply)
      + sas               = (sensitive value)
      + start             = (known after apply)

      + permissions {
          + add    = true
          + create = true
          + delete = true
          + list   = true
          + read   = true
          + write  = true
        }
    }

  # module.fatp_azure_web_app_services_hosting.data.azurerm_storage_account_blob_container_sas.logs["http"] will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_storage_account_blob_container_sas" "logs" {
      + connection_string = (sensitive value)
      + container_name    = "find-a-tp-pr-398httplogs"
      + expiry            = (known after apply)
      + https_only        = true
      + id                = (known after apply)
      + sas               = (sensitive value)
      + start             = (known after apply)

      + permissions {
          + add    = true
          + create = true
          + delete = true
          + list   = true
          + read   = true
          + write  = true
        }
    }

  # module.fatp_azure_web_app_services_hosting.data.dns_a_record_set.web_app_service_ip_address will be read during apply
  # (config refers to values not yet known)
 <= data "dns_a_record_set" "web_app_service_ip_address" {
      + addrs = (known after apply)
      + host  = (known after apply)
      + id    = (known after apply)
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_application_insights.web_app_service will be created
  + resource "azurerm_application_insights" "web_app_service" {
      + app_id                                = (known after apply)
      + application_type                      = "web"
      + connection_string                     = (sensitive value)
      + daily_data_cap_in_gb                  = (known after apply)
      + daily_data_cap_notifications_disabled = (known after apply)
      + disable_ip_masking                    = false
      + force_customer_storage_for_profiler   = false
      + id                                    = (known after apply)
      + instrumentation_key                   = (sensitive value)
      + internet_ingestion_enabled            = true
      + internet_query_enabled                = true
      + local_authentication_disabled         = false
      + location                              = "westeurope"
      + name                                  = "find-a-tp-pr-398-insights"
      + resource_group_name                   = "s177d01-ntp-pr-398"
      + retention_in_days                     = 30
      + sampling_percentage                   = 100
      + tags                                  = {
          + "Environment"      = "pr-398"
          + "Product"          = "National Tutoring Programme"
          + "Service Offering" = "National Tutoring Programme"
        }
      + workspace_id                          = (known after apply)
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_application_insights_standard_web_test.web_app_service[0] will be created
  + resource "azurerm_application_insights_standard_web_test" "web_app_service" {
      + application_insights_id = (known after apply)
      + description             = "Regional HTTP availability check"
      + enabled                 = true
      + frequency               = 300
      + geo_locations           = [
          + "emea-nl-ams-azr",
        ]
      + id                      = (known after apply)
      + location                = "westeurope"
      + name                    = "find-a-tp-pr-398-http"
      + resource_group_name     = "s177d01-ntp-pr-398"
      + synthetic_monitor_id    = (known after apply)
      + tags                    = (known after apply)
      + timeout                 = 10

      + request {
          + follow_redirects_enabled         = true
          + http_verb                        = "GET"
          + parse_dependent_requests_enabled = true
          + url                              = (known after apply)

          + header {
              + name  = "X-AppInsights-HttpTest"
              + value = "find-a-tp-pr-398-insights"
            }
        }
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_cdn_frontdoor_endpoint.endpoint[0] will be created
  + resource "azurerm_cdn_frontdoor_endpoint" "endpoint" {
      + cdn_frontdoor_profile_id = (known after apply)
      + enabled                  = true
      + host_name                = (known after apply)
      + id                       = (known after apply)
      + name                     = "find-a-tp-pr-398-cdnendpoint"
      + tags                     = {
          + "Environment"      = "pr-398"
          + "Product"          = "National Tutoring Programme"
          + "Service Offering" = "National Tutoring Programme"
        }
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_cdn_frontdoor_firewall_policy.waf[0] will be created
  + resource "azurerm_cdn_frontdoor_firewall_policy" "waf" {
      + custom_block_response_body        = "PGh0bWw+CjxoZWFkZXI+PHRpdGxlPkZvcmJpZGRlbjwvdGl0bGU+PC9oZWFkZXI+Cjxib2R5PgpGb3JiaWRkZW4KPC9ib2R5Pgo8L2h0bWw+Cg=="
      + custom_block_response_status_code = 403
      + enabled                           = true
      + frontend_endpoint_ids             = (known after apply)
      + id                                = (known after apply)
      + mode                              = "Prevention"
      + name                              = "findatppr398waf"
      + resource_group_name               = "s177d01-ntp-pr-398"
      + sku_name                          = "Standard_AzureFrontDoor"
      + tags                              = {
          + "Environment"      = "pr-398"
          + "Product"          = "National Tutoring Programme"
          + "Service Offering" = "National Tutoring Programme"
        }

      + custom_rule {
          + action                         = "Block"
          + enabled                        = true
          + name                           = "RateLimiting"
          + priority                       = 1
          + rate_limit_duration_in_minutes = 1
          + rate_limit_threshold           = 300
          + type                           = "RateLimitRule"

          + match_condition {
              + match_values       = [
                  + "/.*",
                ]
              + match_variable     = "RequestUri"
              + negation_condition = false
              + operator           = "RegEx"
            }
        }
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_cdn_frontdoor_origin.origin[0] will be created
  + resource "azurerm_cdn_frontdoor_origin" "origin" {
      + cdn_frontdoor_origin_group_id  = (known after apply)
      + certificate_name_check_enabled = true
      + enabled                        = true
      + health_probes_enabled          = (known after apply)
      + host_name                      = (known after apply)
      + http_port                      = 80
      + https_port                     = 443
      + id                             = (known after apply)
      + name                           = "find-a-tp-pr-398origin"
      + origin_host_header             = (known after apply)
      + priority                       = 1
      + weight                         = 500
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_cdn_frontdoor_origin_group.group[0] will be created
  + resource "azurerm_cdn_frontdoor_origin_group" "group" {
      + cdn_frontdoor_profile_id                                  = (known after apply)
      + id                                                        = (known after apply)
      + name                                                      = "find-a-tp-pr-398-origingroup"
      + restore_traffic_time_to_healed_or_new_endpoint_in_minutes = 10
      + session_affinity_enabled                                  = true

      + health_probe {
          + interval_in_seconds = 30
          + path                = "/"
          + protocol            = "Https"
          + request_type        = "GET"
        }

      + load_balancing {
          + additional_latency_in_milliseconds = 50
          + sample_size                        = 4
          + successful_samples_required        = 3
        }
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_cdn_frontdoor_profile.cdn[0] will be created
  + resource "azurerm_cdn_frontdoor_profile" "cdn" {
      + id                       = (known after apply)
      + name                     = "find-a-tp-pr-398-cdn"
      + resource_group_name      = "s177d01-ntp-pr-398"
      + resource_guid            = (known after apply)
      + response_timeout_seconds = 120
      + sku_name                 = "Standard_AzureFrontDoor"
      + tags                     = {
          + "Environment"      = "pr-398"
          + "Product"          = "National Tutoring Programme"
          + "Service Offering" = "National Tutoring Programme"
        }
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_cdn_frontdoor_route.route[0] will be created
  + resource "azurerm_cdn_frontdoor_route" "route" {
      + cdn_frontdoor_endpoint_id     = (known after apply)
      + cdn_frontdoor_origin_group_id = (known after apply)
      + cdn_frontdoor_origin_ids      = (known after apply)
      + enabled                       = true
      + forwarding_protocol           = "HttpsOnly"
      + https_redirect_enabled        = true
      + id                            = (known after apply)
      + link_to_default_domain        = true
      + name                          = "find-a-tp-pr-398route"
      + patterns_to_match             = [
          + "/*",
        ]
      + supported_protocols           = [
          + "Http",
          + "Https",
        ]
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_cdn_frontdoor_security_policy.waf[0] will be created
  + resource "azurerm_cdn_frontdoor_security_policy" "waf" {
      + cdn_frontdoor_profile_id = (known after apply)
      + id                       = (known after apply)
      + name                     = "findatppr398wafsecuritypolicy"

      + security_policies {
          + firewall {
              + cdn_frontdoor_firewall_policy_id = (known after apply)

              + association {
                  + patterns_to_match = [
                      + "/*",
                    ]

                  + domain {
                      + active                  = (known after apply)
                      + cdn_frontdoor_domain_id = (known after apply)
                    }
                }
            }
        }
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_key_vault.default will be created
  + resource "azurerm_key_vault" "default" {
      + access_policy                 = [
          + {
              + key_permissions    = [
                  + "Create",
                  + "Get",
                ]
              + object_id          = "049a4264-d53c-47da-ba4b-d8f2dc8ff057"
              + secret_permissions = [
                  + "Set",
                  + "Get",
                  + "Delete",
                  + "Purge",
                  + "Recover",
                  + "List",
                ]
              + tenant_id          = "9c7d9dd3-840c-4b3f-818e-552865082e16"
            },
          + {
              + key_permissions    = [
                  + "Get",
                  + "List",
                ]
              + object_id          = (known after apply)
              + secret_permissions = [
                  + "Get",
                  + "List",
                ]
              + tenant_id          = "9c7d9dd3-840c-4b3f-818e-552865082e16"
            },
        ]
      + enabled_for_disk_encryption   = true
      + id                            = (known after apply)
      + location                      = "westeurope"
      + name                          = "find-a-tp-pr-398-kv"
      + public_network_access_enabled = true
      + purge_protection_enabled      = true
      + resource_group_name           = "s177d01-ntp-pr-398"
      + sku_name                      = "standard"
      + soft_delete_retention_days    = 7
      + tags                          = {
          + "Environment"      = "pr-398"
          + "Product"          = "National Tutoring Programme"
          + "Service Offering" = "National Tutoring Programme"
        }
      + tenant_id                     = "9c7d9dd3-840c-4b3f-818e-552865082e16"
      + vault_uri                     = (known after apply)

      + network_acls {
          + bypass                     = "AzureServices"
          + default_action             = "Deny"
          + ip_rules                   = (known after apply)
          + virtual_network_subnet_ids = (known after apply)
        }
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_key_vault_secret.blobstorageclientsecret will be created
  + resource "azurerm_key_vault_secret" "blobstorageclientsecret" {
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "BlobStorage--ClientSecret"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_key_vault_secret.fatpdbconnectionstring will be created
  + resource "azurerm_key_vault_secret" "fatpdbconnectionstring" {
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "ConnectionStrings--FatpDatabase"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_key_vault_secret.fatpredisconnectionstring will be created
  + resource "azurerm_key_vault_secret" "fatpredisconnectionstring" {
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "ConnectionStrings--FatpRedis"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_key_vault_secret.govuknotifyapikey will be created
  + resource "azurerm_key_vault_secret" "govuknotifyapikey" {
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "GovUkNotify--ApiKey"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_linux_web_app.default[0] will be created
  + resource "azurerm_linux_web_app" "default" {
      + app_settings                      = (known after apply)
      + client_affinity_enabled           = false
      + client_certificate_enabled        = false
      + client_certificate_mode           = "Required"
      + custom_domain_verification_id     = (sensitive value)
      + default_hostname                  = (known after apply)
      + enabled                           = true
      + https_only                        = true
      + id                                = (known after apply)
      + key_vault_reference_identity_id   = (known after apply)
      + kind                              = (known after apply)
      + location                          = "westeurope"
      + name                              = "find-a-tp-pr-398"
      + outbound_ip_address_list          = (known after apply)
      + outbound_ip_addresses             = (known after apply)
      + possible_outbound_ip_address_list = (known after apply)
      + possible_outbound_ip_addresses    = (known after apply)
      + resource_group_name               = "s177d01-ntp-pr-398"
      + service_plan_id                   = (known after apply)
      + site_credential                   = (known after apply)
      + tags                              = {
          + "Environment"      = "pr-398"
          + "Product"          = "National Tutoring Programme"
          + "Service Offering" = "National Tutoring Programme"
        }
      + virtual_network_subnet_id         = (known after apply)
      + zip_deploy_file                   = (known after apply)

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + logs {
          + detailed_error_messages = true
          + failed_request_tracing  = true

          + application_logs {
              + file_system_level = "Information"

              + azure_blob_storage {
                  + level             = "Information"
                  + retention_in_days = 30
                  + sas_url           = (sensitive value)
                }
            }

          + http_logs {
              + azure_blob_storage {
                  + retention_in_days = 30
                  + sas_url           = (sensitive value)
                }
            }
        }

      + site_config {
          + always_on                               = true
          + container_registry_use_managed_identity = false
          + default_documents                       = (known after apply)
          + detailed_error_logging_enabled          = (known after apply)
          + ftps_state                              = "Disabled"
          + health_check_eviction_time_in_min       = 5
          + health_check_path                       = "/health"
          + http2_enabled                           = true
          + ip_restriction                          = [
              + {
                  + action      = "Allow"
                  + headers     = [
                      + {
                          + x_azure_fdid = (known after apply)
                        },
                    ]
                  + name        = "Allow CDN Traffic"
                  + priority    = 65000
                  + service_tag = "AzureFrontDoor.Backend"
                },
            ]
          + linux_fx_version                        = (known after apply)
          + load_balancing_mode                     = "LeastRequests"
          + local_mysql_enabled                     = false
          + managed_pipeline_mode                   = "Integrated"
          + minimum_tls_version                     = "1.2"
          + remote_debugging_enabled                = false
          + remote_debugging_version                = (known after apply)
          + scm_ip_restriction                      = (known after apply)
          + scm_minimum_tls_version                 = "1.2"
          + scm_type                                = (known after apply)
          + scm_use_main_ip_restriction             = false
          + use_32_bit_worker                       = true
          + vnet_route_all_enabled                  = true
          + websockets_enabled                      = false
          + worker_count                            = 3

          + application_stack {
              + dotnet_version = "6.0"
            }
        }
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_log_analytics_workspace.web_app_service will be created
  + resource "azurerm_log_analytics_workspace" "web_app_service" {
      + allow_resource_only_permissions    = true
      + daily_quota_gb                     = -1
      + id                                 = (known after apply)
      + internet_ingestion_enabled         = true
      + internet_query_enabled             = true
      + local_authentication_disabled      = false
      + location                           = "westeurope"
      + name                               = "find-a-tp-pr-398-webappservice"
      + primary_shared_key                 = (sensitive value)
      + reservation_capacity_in_gb_per_day = (known after apply)
      + resource_group_name                = "s177d01-ntp-pr-398"
      + retention_in_days                  = 30
      + secondary_shared_key               = (sensitive value)
      + sku                                = "PerGB2018"
      + tags                               = {
          + "Environment"      = "pr-398"
          + "Product"          = "National Tutoring Programme"
          + "Service Offering" = "National Tutoring Programme"
        }
      + workspace_id                       = (known after apply)
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_logic_app_action_http.slack[0] will be created
  + resource "azurerm_logic_app_action_http" "slack" {
      + body         = jsonencode(
            {
              + attachments = [
                  + {
                      + blocks = [
                          + {
                              + text = {
                                  + text = "@{triggerBody()?['data']?['essentials']?['alertRule']}"
                                  + type = "plain_text"
                                }
                              + type = "header"
                            },
                          + {
                              + text = {
                                  + text = "_@{triggerBody()?['data']?['essentials']?['description']}_"
                                  + type = "mrkdwn"
                                }
                              + type = "section"
                            },
                          + {
                              + fields = [
                                  + {
                                      + text = "*Severity*"
                                      + type = "mrkdwn"
                                    },
                                  + {
                                      + text = "@{triggerBody()?['data']?['essentials']?['severity']}"
                                      + type = "plain_text"
                                    },
                                  + {
                                      + text = "*Metric definition*"
                                      + type = "mrkdwn"
                                    },
                                  + {
                                      + text = "@{triggerBody()?['data']?['alertContext']?['condition']?['allOf']?[0]?['metricName']} @{triggerBody()?['data']?['alertContext']?['condition']?['allOf']?[0]?['operator']} @{triggerBody()?['data']?['alertContext']?['condition']?['allOf']?[0]?['threshold']}"
                                      + type = "plain_text"
                                    },
                                  + {
                                      + text = "*Metric value recorded*"
                                      + type = "mrkdwn"
                                    },
                                  + {
                                      + text = "@{triggerBody()?['data']?['alertContext']?['condition']?['allOf']?[0]?['metricValue']} "
                                      + type = "plain_text"
                                    },
                                  + {
                                      + text = "*Alarm status*"
                                      + type = "mrkdwn"
                                    },
                                  + {
                                      + text = "@{triggerBody()?['data']?['essentials']?['monitorCondition']} "
                                      + type = "plain_text"
                                    },
                                ]
                              + type   = "section"
                            },
                        ]
                      + color  = "#FF0000"
                    },
                ]
              + blocks      = [
                  + {
                      + text = {
                          + text = "<!here>"
                          + type = "mrkdwn"
                        }
                      + type = "section"
                    },
                ]
              + channel     = "#ntp-dev-team"
              + text        = "@{triggerBody()?['data']?['essentials']?['alertRule']}: @{triggerBody()?['data']?['essentials']?['description']}"
            }
        )
      + headers      = {
          + "Content-Type" = "application/json"
        }
      + id           = (known after apply)
      + logic_app_id = (known after apply)
      + method       = "POST"
      + name         = "find-a-tp-pr-398-action"
      + uri          = (sensitive value)
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_logic_app_trigger_http_request.webhook[0] will be created
  + resource "azurerm_logic_app_trigger_http_request" "webhook" {
      + callback_url = (known after apply)
      + id           = (known after apply)
      + logic_app_id = (known after apply)
      + name         = "find-a-tp-pr-398-trigger"
      + schema       = jsonencode(
            {
              + properties = {
                  + data     = {
                      + properties = {
                          + alertContext = {
                              + properties = {}
                              + type       = "object"
                            }
                          + essentials   = {
                              + properties = {
                                  + alertContextVersion = {
                                      + type = "string"
                                    }
                                  + alertId             = {
                                      + type = "string"
                                    }
                                  + alertRule           = {
                                      + type = "string"
                                    }
                                  + alertTargetIDs      = {
                                      + items = {
                                          + type = "string"
                                        }
                                      + type  = "array"
                                    }
                                  + description         = {
                                      + type = "string"
                                    }
                                  + essentialsVersion   = {
                                      + type = "string"
                                    }
                                  + firedDateTime       = {
                                      + type = "string"
                                    }
                                  + monitorCondition    = {
                                      + type = "string"
                                    }
                                  + monitoringService   = {
                                      + type = "string"
                                    }
                                  + originAlertId       = {
                                      + type = "string"
                                    }
                                  + resolvedDateTime    = {
                                      + type = "string"
                                    }
                                  + severity            = {
                                      + type = "string"
                                    }
                                  + signalType          = {
                                      + type = "string"
                                    }
                                }
                              + type       = "object"
                            }
                        }
                      + type       = "object"
                    }
                  + schemaId = {
                      + type = "string"
                    }
                }
              + type       = "object"
            }
        )
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_logic_app_workflow.webhook[0] will be created
  + resource "azurerm_logic_app_workflow" "webhook" {
      + access_endpoint                 = (known after apply)
      + connector_endpoint_ip_addresses = (known after apply)
      + connector_outbound_ip_addresses = (known after apply)
      + enabled                         = true
      + id                              = (known after apply)
      + location                        = "westeurope"
      + name                            = "find-a-tp-pr-398-webhook-workflow"
      + resource_group_name             = "s177d01-ntp-pr-398"
      + tags                            = {
          + "Environment"      = "pr-398"
          + "Product"          = "National Tutoring Programme"
          + "Service Offering" = "National Tutoring Programme"
        }
      + workflow_endpoint_ip_addresses  = (known after apply)
      + workflow_outbound_ip_addresses  = (known after apply)
      + workflow_schema                 = "https://schema.management.azure.com/providers/Microsoft.Logic/schemas/2016-06-01/workflowdefinition.json#"
      + workflow_version                = "1.0.0.0"
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_monitor_action_group.web_app_service[0] will be created
  + resource "azurerm_monitor_action_group" "web_app_service" {
      + enabled             = true
      + id                  = (known after apply)
      + location            = "global"
      + name                = "find-a-tp-pr-398-actiongroup"
      + resource_group_name = "s177d01-ntp-pr-398"
      + short_name          = "s177d01-ntp-"
      + tags                = {
          + "Environment"      = "pr-398"
          + "Product"          = "National Tutoring Programme"
          + "Service Offering" = "National Tutoring Programme"
        }

      + email_receiver {
          + email_address           = "Hasan.AHMED@education.gov.uk"
          + name                    = "Email Hasan.AHMED@education.gov.uk"
          + use_common_alert_schema = true
        }
      + email_receiver {
          + email_address           = "Kiril.KOLEV@education.gov.uk"
          + name                    = "Email Kiril.KOLEV@education.gov.uk"
          + use_common_alert_schema = true
        }
      + email_receiver {
          + email_address           = "Kieran.OHANLON@education.gov.uk"
          + name                    = "Email Kieran.OHANLON@education.gov.uk"
          + use_common_alert_schema = true
        }
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_monitor_diagnostic_setting.default_key_vault[0] will be created
  + resource "azurerm_monitor_diagnostic_setting" "default_key_vault" {
      + id                             = (known after apply)
      + log_analytics_destination_type = "Dedicated"
      + log_analytics_workspace_id     = (known after apply)
      + name                           = "find-a-tp-pr-398-default-kv-diag"
      + target_resource_id             = (known after apply)

      + enabled_log {
          + category = "AuditEvent"

          + retention_policy {
              + days    = 7
              + enabled = true
            }
        }

      + metric {
          + category = "AllMetrics"
          + enabled  = true

          + retention_policy {
              + days    = 7
              + enabled = true
            }
        }
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_monitor_diagnostic_setting.default_redis_cache[0] will be created
  + resource "azurerm_monitor_diagnostic_setting" "default_redis_cache" {
      + id                             = (known after apply)
      + log_analytics_destination_type = "Dedicated"
      + log_analytics_workspace_id     = (known after apply)
      + name                           = "find-a-tp-pr-398-default-redis-diag"
      + target_resource_id             = (known after apply)

      + enabled_log {
          + category = "ConnectedClientList"

          + retention_policy {
              + days    = 7
              + enabled = true
            }
        }

      + metric {
          + category = "AllMetrics"
          + enabled  = true

          + retention_policy {
              + days    = 7
              + enabled = true
            }
        }
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_monitor_diagnostic_setting.web_app[0] will be created
  + resource "azurerm_monitor_diagnostic_setting" "web_app" {
      + id                             = (known after apply)
      + log_analytics_destination_type = "Dedicated"
      + log_analytics_workspace_id     = (known after apply)
      + name                           = "find-a-tp-pr-398-storage-diag"
      + target_resource_id             = (known after apply)

      + metric {
          + category = "Transaction"
          + enabled  = true

          + retention_policy {
              + enabled = false
            }
        }
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_monitor_diagnostic_setting.web_app_service will be created
  + resource "azurerm_monitor_diagnostic_setting" "web_app_service" {
      + id                             = (known after apply)
      + log_analytics_destination_type = (known after apply)
      + log_analytics_workspace_id     = (known after apply)
      + name                           = "find-a-tp-pr-398-webappservice"
      + target_resource_id             = (known after apply)

      + enabled_log {
          + category = "AppServiceAppLogs"

          + retention_policy {
              + days    = 30
              + enabled = true
            }
        }
      + enabled_log {
          + category = "AppServiceAuditLogs"

          + retention_policy {
              + days    = 30
              + enabled = true
            }
        }
      + enabled_log {
          + category = "AppServiceConsoleLogs"

          + retention_policy {
              + days    = 30
              + enabled = true
            }
        }
      + enabled_log {
          + category = "AppServiceHTTPLogs"

          + retention_policy {
              + days    = 30
              + enabled = true
            }
        }
      + enabled_log {
          + category = "AppServiceIPSecAuditLogs"

          + retention_policy {
              + days    = 30
              + enabled = true
            }
        }
      + enabled_log {
          + category = "AppServicePlatformLogs"

          + retention_policy {
              + days    = 30
              + enabled = true
            }
        }

      + metric {
          + category = "AllMetrics"
          + enabled  = true

          + retention_policy {
              + days    = 30
              + enabled = true
            }
        }
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_monitor_diagnostic_setting.webhook[0] will be created
  + resource "azurerm_monitor_diagnostic_setting" "webhook" {
      + id                             = (known after apply)
      + log_analytics_destination_type = "Dedicated"
      + log_analytics_workspace_id     = (known after apply)
      + name                           = "find-a-tp-pr-398-webhook-diag"
      + target_resource_id             = (known after apply)

      + enabled_log {
          + category = "WorkflowRuntime"

          + retention_policy {
              + days    = 7
              + enabled = true
            }
        }

      + metric {
          + category = "AllMetrics"
          + enabled  = true

          + retention_policy {
              + days    = 7
              + enabled = true
            }
        }
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_monitor_metric_alert.cpu[0] will be created
  + resource "azurerm_monitor_metric_alert" "cpu" {
      + auto_mitigate            = true
      + description              = "Action will be triggered when CPU usage is higher than 80% for longer than 5 minutes"
      + enabled                  = true
      + frequency                = "PT5M"
      + id                       = (known after apply)
      + name                     = "find-a-tp-pr-398-cpu"
      + resource_group_name      = "s177d01-ntp-pr-398"
      + scopes                   = (known after apply)
      + severity                 = 2
      + tags                     = {
          + "Environment"      = "pr-398"
          + "Product"          = "National Tutoring Programme"
          + "Service Offering" = "National Tutoring Programme"
        }
      + target_resource_location = (known after apply)
      + target_resource_type     = (known after apply)
      + window_size              = "PT5M"

      + action {
          + action_group_id = (known after apply)
        }

      + criteria {
          + aggregation            = "Average"
          + metric_name            = "CpuPercentage"
          + metric_namespace       = "microsoft.web/serverfarms"
          + operator               = "GreaterThan"
          + skip_metric_validation = false
          + threshold              = 80
        }
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_monitor_metric_alert.http[0] will be created
  + resource "azurerm_monitor_metric_alert" "http" {
      + auto_mitigate            = true
      + description              = "Action will be triggered when regional availability becomes impacted."
      + enabled                  = true
      + frequency                = "PT1M"
      + id                       = (known after apply)
      + name                     = "find-a-tp-pr-398-http"
      + resource_group_name      = "s177d01-ntp-pr-398"
      + scopes                   = (known after apply)
      + severity                 = 2
      + tags                     = {
          + "Environment"      = "pr-398"
          + "Product"          = "National Tutoring Programme"
          + "Service Offering" = "National Tutoring Programme"
        }
      + target_resource_location = (known after apply)
      + target_resource_type     = (known after apply)
      + window_size              = "PT5M"

      + action {
          + action_group_id = (known after apply)
        }

      + application_insights_web_test_location_availability_criteria {
          + component_id          = (known after apply)
          + failed_location_count = 1
          + web_test_id           = (known after apply)
        }
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_monitor_metric_alert.latency[0] will be created
  + resource "azurerm_monitor_metric_alert" "latency" {
      + auto_mitigate            = true
      + description              = "Action will be triggered when Origin latency is higher than 2s"
      + enabled                  = true
      + frequency                = "PT5M"
      + id                       = (known after apply)
      + name                     = "find-a-tp-pr-398-cdn-latency"
      + resource_group_name      = "s177d01-ntp-pr-398"
      + scopes                   = (known after apply)
      + severity                 = 2
      + tags                     = {
          + "Environment"      = "pr-398"
          + "Product"          = "National Tutoring Programme"
          + "Service Offering" = "National Tutoring Programme"
        }
      + target_resource_location = (known after apply)
      + target_resource_type     = (known after apply)
      + window_size              = "PT5M"

      + action {
          + action_group_id = (known after apply)
        }

      + criteria {
          + aggregation            = "Average"
          + metric_name            = "TotalLatency"
          + metric_namespace       = "Microsoft.Cdn/profiles"
          + operator               = "GreaterThan"
          + skip_metric_validation = false
          + threshold              = 2000
        }
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_monitor_metric_alert.memory[0] will be created
  + resource "azurerm_monitor_metric_alert" "memory" {
      + auto_mitigate            = true
      + description              = "Action will be triggered when memory usage is higher than 80% for longer than 5 minutes"
      + enabled                  = true
      + frequency                = "PT5M"
      + id                       = (known after apply)
      + name                     = "find-a-tp-pr-398-memory"
      + resource_group_name      = "s177d01-ntp-pr-398"
      + scopes                   = (known after apply)
      + severity                 = 2
      + tags                     = {
          + "Environment"      = "pr-398"
          + "Product"          = "National Tutoring Programme"
          + "Service Offering" = "National Tutoring Programme"
        }
      + target_resource_location = (known after apply)
      + target_resource_type     = (known after apply)
      + window_size              = "PT5M"

      + action {
          + action_group_id = (known after apply)
        }

      + criteria {
          + aggregation            = "Average"
          + metric_name            = "MemoryPercentage"
          + metric_namespace       = "microsoft.web/serverfarms"
          + operator               = "GreaterThan"
          + skip_metric_validation = false
          + threshold              = 80
        }
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_monitor_scheduled_query_rules_alert.web_app_service[0] will be created
  + resource "azurerm_monitor_scheduled_query_rules_alert" "web_app_service" {
      + auto_mitigation_enabled = true
      + data_source_id          = (known after apply)
      + description             = "This rule triggers when there are traces or requests with a result code of 500 or a severity level of 3."
      + enabled                 = true
      + frequency               = 5
      + id                      = (known after apply)
      + location                = "westeurope"
      + name                    = "find-a-tp-pr-398-webapp-errors"
      + query                   = <<-EOT
            traces
            | union requests
            | where resultCode == "500" or severityLevel == 3
            | where timestamp > ago(5m)
            | order by timestamp desc
            | take 1
        EOT
      + query_type              = "ResultCount"
      + resource_group_name     = "s177d01-ntp-pr-398"
      + severity                = 0
      + tags                    = {
          + "Environment"      = "pr-398"
          + "Product"          = "National Tutoring Programme"
          + "Service Offering" = "National Tutoring Programme"
        }
      + time_window             = 6

      + action {
          + action_group = (known after apply)
        }

      + trigger {
          + operator  = "Equal"
          + threshold = 1
        }
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_nat_gateway.default[0] will be created
  + resource "azurerm_nat_gateway" "default" {
      + id                      = (known after apply)
      + idle_timeout_in_minutes = 4
      + location                = "westeurope"
      + name                    = "find-a-tp-pr-398-default"
      + resource_group_name     = "s177d01-ntp-pr-398"
      + resource_guid           = (known after apply)
      + sku_name                = "Standard"
      + tags                    = {
          + "Environment"      = "pr-398"
          + "Product"          = "National Tutoring Programme"
          + "Service Offering" = "National Tutoring Programme"
        }
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_nat_gateway_public_ip_association.default[0] will be created
  + resource "azurerm_nat_gateway_public_ip_association" "default" {
      + id                   = (known after apply)
      + nat_gateway_id       = (known after apply)
      + public_ip_address_id = (known after apply)
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_network_security_group.web_app_service_infra_allow_frontdoor_inbound_only[0] will be created
  + resource "azurerm_network_security_group" "web_app_service_infra_allow_frontdoor_inbound_only" {
      + id                  = (known after apply)
      + location            = "westeurope"
      + name                = "find-a-tp-pr-398-webappserviceinfransg"
      + resource_group_name = "s177d01-ntp-pr-398"
      + security_rule       = [
          + {
              + access                                     = "Allow"
              + description                                = ""
              + destination_address_prefix                 = (known after apply)
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = "443"
              + destination_port_ranges                    = []
              + direction                                  = "Inbound"
              + name                                       = "AllowFrontdoor"
              + priority                                   = 100
              + protocol                                   = "*"
              + source_address_prefix                      = "AzureFrontDoor.Backend"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
            },
        ]
      + tags                = {
          + "Environment"      = "pr-398"
          + "Product"          = "National Tutoring Programme"
          + "Service Offering" = "National Tutoring Programme"
        }
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_postgresql_flexible_server.default will be created
  + resource "azurerm_postgresql_flexible_server" "default" {
      + administrator_login           = (sensitive value)
      + administrator_password        = (sensitive value)
      + backup_retention_days         = 35
      + fqdn                          = (known after apply)
      + geo_redundant_backup_enabled  = false
      + id                            = (known after apply)
      + location                      = "westeurope"
      + name                          = "find-a-tp-pr-398-psqlflexible-server"
      + private_dns_zone_id           = (known after apply)
      + public_network_access_enabled = (known after apply)
      + resource_group_name           = "s177d01-ntp-pr-398"
      + sku_name                      = "B_Standard_B1ms"
      + storage_mb                    = 32768
      + tags                          = {
          + "Environment"      = "pr-398"
          + "Product"          = "National Tutoring Programme"
          + "Service Offering" = "National Tutoring Programme"
        }
      + version                       = "14"
      + zone                          = "1"
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_postgresql_flexible_server_configuration.extensions[0] will be created
  + resource "azurerm_postgresql_flexible_server_configuration" "extensions" {
      + id        = (known after apply)
      + name      = "azure.extensions"
      + server_id = (known after apply)
      + value     = "CITEXT,UUID-OSSP"
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_postgresql_flexible_server_database.default will be created
  + resource "azurerm_postgresql_flexible_server_database" "default" {
      + charset   = "utf8"
      + collation = "en_US.utf8"
      + id        = (known after apply)
      + name      = "find-a-tp-pr-398-db"
      + server_id = (known after apply)
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_postgresql_flexible_server_firewall_rule.web_app_default_static_ip[0] will be created
  + resource "azurerm_postgresql_flexible_server_firewall_rule" "web_app_default_static_ip" {
      + end_ip_address   = (known after apply)
      + id               = (known after apply)
      + name             = "find-a-tp-pr-398webapp"
      + server_id        = (known after apply)
      + start_ip_address = (known after apply)
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_public_ip.nat_gateway[0] will be created
  + resource "azurerm_public_ip" "nat_gateway" {
      + allocation_method       = "Static"
      + ddos_protection_mode    = "VirtualNetworkInherited"
      + fqdn                    = (known after apply)
      + id                      = (known after apply)
      + idle_timeout_in_minutes = 4
      + ip_address              = (known after apply)
      + ip_version              = "IPv4"
      + location                = "westeurope"
      + name                    = "find-a-tp-pr-398-natgateway"
      + resource_group_name     = "s177d01-ntp-pr-398"
      + sku                     = "Standard"
      + sku_tier                = "Regional"
      + tags                    = {
          + "Environment"      = "pr-398"
          + "Product"          = "National Tutoring Programme"
          + "Service Offering" = "National Tutoring Programme"
        }
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_redis_cache.default will be created
  + resource "azurerm_redis_cache" "default" {
      + capacity                      = 0
      + enable_non_ssl_port           = false
      + family                        = "C"
      + hostname                      = (known after apply)
      + id                            = (known after apply)
      + location                      = "westeurope"
      + minimum_tls_version           = "1.2"
      + name                          = "find-a-tp-pr-398-redis-cache"
      + port                          = (known after apply)
      + primary_access_key            = (sensitive value)
      + primary_connection_string     = (sensitive value)
      + private_static_ip_address     = (known after apply)
      + public_network_access_enabled = true
      + redis_version                 = "6"
      + replicas_per_master           = (known after apply)
      + replicas_per_primary          = (known after apply)
      + resource_group_name           = "s177d01-ntp-pr-398"
      + secondary_access_key          = (sensitive value)
      + secondary_connection_string   = (sensitive value)
      + sku_name                      = "Standard"
      + ssl_port                      = (known after apply)
      + tags                          = {
          + "Environment"      = "pr-398"
          + "Product"          = "National Tutoring Programme"
          + "Service Offering" = "National Tutoring Programme"
        }

      + patch_schedule {
          + day_of_week        = "Sunday"
          + maintenance_window = "PT5H"
          + start_hour_utc     = 23
        }

      + redis_configuration {
          + enable_authentication           = true
          + maxclients                      = (known after apply)
          + maxfragmentationmemory_reserved = (known after apply)
          + maxmemory_delta                 = (known after apply)
          + maxmemory_policy                = "volatile-lru"
          + maxmemory_reserved              = (known after apply)
        }
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_redis_firewall_rule.web_app_default_static_ip will be created
  + resource "azurerm_redis_firewall_rule" "web_app_default_static_ip" {
      + end_ip              = (known after apply)
      + id                  = (known after apply)
      + name                = "findatppr398webapp"
      + redis_cache_name    = "find-a-tp-pr-398-redis-cache"
      + resource_group_name = "s177d01-ntp-pr-398"
      + start_ip            = (known after apply)
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_resource_group.default[0] will be created
  + resource "azurerm_resource_group" "default" {
      + id       = (known after apply)
      + location = "westeurope"
      + name     = "s177d01-ntp-pr-398"
      + tags     = {
          + "Environment"      = "pr-398"
          + "Product"          = "National Tutoring Programme"
          + "Service Offering" = "National Tutoring Programme"
        }
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_route_table.default[0] will be created
  + resource "azurerm_route_table" "default" {
      + disable_bgp_route_propagation = false
      + id                            = (known after apply)
      + location                      = "westeurope"
      + name                          = "find-a-tp-pr-398-default"
      + resource_group_name           = "s177d01-ntp-pr-398"
      + route                         = (known after apply)
      + subnets                       = (known after apply)
      + tags                          = {
          + "Environment"      = "pr-398"
          + "Product"          = "National Tutoring Programme"
          + "Service Offering" = "National Tutoring Programme"
        }
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_service_plan.default will be created
  + resource "azurerm_service_plan" "default" {
      + id                           = (known after apply)
      + kind                         = (known after apply)
      + location                     = "westeurope"
      + maximum_elastic_worker_count = (known after apply)
      + name                         = "find-a-tp-pr-398"
      + os_type                      = "Linux"
      + per_site_scaling_enabled     = true
      + reserved                     = (known after apply)
      + resource_group_name          = "s177d01-ntp-pr-398"
      + sku_name                     = "S2"
      + tags                         = {
          + "Environment"      = "pr-398"
          + "Product"          = "National Tutoring Programme"
          + "Service Offering" = "National Tutoring Programme"
        }
      + worker_count                 = (known after apply)
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_storage_account.logs[0] will be created
  + resource "azurerm_storage_account" "logs" {
      + access_tier                       = (known after apply)
      + account_kind                      = "StorageV2"
      + account_replication_type          = "LRS"
      + account_tier                      = "Standard"
      + allow_nested_items_to_be_public   = true
      + cross_tenant_replication_enabled  = true
      + default_to_oauth_authentication   = false
      + enable_https_traffic_only         = true
      + id                                = (known after apply)
      + infrastructure_encryption_enabled = false
      + is_hns_enabled                    = false
      + large_file_share_enabled          = (known after apply)
      + location                          = "westeurope"
      + min_tls_version                   = "TLS1_2"
      + name                              = "findatppr398logs"
      + nfsv3_enabled                     = false
      + primary_access_key                = (sensitive value)
      + primary_blob_connection_string    = (sensitive value)
      + primary_blob_endpoint             = (known after apply)
      + primary_blob_host                 = (known after apply)
      + primary_connection_string         = (sensitive value)
      + primary_dfs_endpoint              = (known after apply)
      + primary_dfs_host                  = (known after apply)
      + primary_file_endpoint             = (known after apply)
      + primary_file_host                 = (known after apply)
      + primary_location                  = (known after apply)
      + primary_queue_endpoint            = (known after apply)
      + primary_queue_host                = (known after apply)
      + primary_table_endpoint            = (known after apply)
      + primary_table_host                = (known after apply)
      + primary_web_endpoint              = (known after apply)
      + primary_web_host                  = (known after apply)
      + public_network_access_enabled     = true
      + queue_encryption_key_type         = "Service"
      + resource_group_name               = "s177d01-ntp-pr-398"
      + secondary_access_key              = (sensitive value)
      + secondary_blob_connection_string  = (sensitive value)
      + secondary_blob_endpoint           = (known after apply)
      + secondary_blob_host               = (known after apply)
      + secondary_connection_string       = (sensitive value)
      + secondary_dfs_endpoint            = (known after apply)
      + secondary_dfs_host                = (known after apply)
      + secondary_file_endpoint           = (known after apply)
      + secondary_file_host               = (known after apply)
      + secondary_location                = (known after apply)
      + secondary_queue_endpoint          = (known after apply)
      + secondary_queue_host              = (known after apply)
      + secondary_table_endpoint          = (known after apply)
      + secondary_table_host              = (known after apply)
      + secondary_web_endpoint            = (known after apply)
      + secondary_web_host                = (known after apply)
      + sftp_enabled                      = false
      + shared_access_key_enabled         = true
      + table_encryption_key_type         = "Service"
      + tags                              = {
          + "Environment"      = "pr-398"
          + "Product"          = "National Tutoring Programme"
          + "Service Offering" = "National Tutoring Programme"
        }
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_storage_account_network_rules.logs[0] will be created
  + resource "azurerm_storage_account_network_rules" "logs" {
      + bypass                     = [
          + "AzureServices",
        ]
      + default_action             = "Deny"
      + id                         = (known after apply)
      + ip_rules                   = (known after apply)
      + storage_account_id         = (known after apply)
      + virtual_network_subnet_ids = (known after apply)

      + private_link_access {
          + endpoint_resource_id = (known after apply)
          + endpoint_tenant_id   = (known after apply)
        }
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_storage_container.logs["app"] will be created
  + resource "azurerm_storage_container" "logs" {
      + container_access_type   = "private"
      + has_immutability_policy = (known after apply)
      + has_legal_hold          = (known after apply)
      + id                      = (known after apply)
      + metadata                = (known after apply)
      + name                    = "find-a-tp-pr-398applogs"
      + resource_manager_id     = (known after apply)
      + storage_account_name    = "findatppr398logs"
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_storage_container.logs["http"] will be created
  + resource "azurerm_storage_container" "logs" {
      + container_access_type   = "private"
      + has_immutability_policy = (known after apply)
      + has_legal_hold          = (known after apply)
      + id                      = (known after apply)
      + metadata                = (known after apply)
      + name                    = "find-a-tp-pr-398httplogs"
      + resource_manager_id     = (known after apply)
      + storage_account_name    = "findatppr398logs"
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_subnet.keyvault_subnet will be created
  + resource "azurerm_subnet" "keyvault_subnet" {
      + address_prefixes                               = [
          + "10.0.8.0/23",
        ]
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "find-a-tp-pr-398keyvault"
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = "s177d01-ntp-pr-398"
      + service_endpoints                              = [
          + "Microsoft.KeyVault",
        ]
      + virtual_network_name                           = "find-a-tp-pr-398-default"
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_subnet.web_app_service_infra_subnet[0] will be created
  + resource "azurerm_subnet" "web_app_service_infra_subnet" {
      + address_prefixes                               = [
          + "10.0.0.0/23",
        ]
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "find-a-tp-pr-398-webappserviceinfra"
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = "s177d01-ntp-pr-398"
      + service_endpoints                              = [
          + "Microsoft.Storage",
        ]
      + virtual_network_name                           = "find-a-tp-pr-398-default"

      + delegation {
          + name = "delegation"

          + service_delegation {
              + actions = [
                  + "Microsoft.Network/virtualNetworks/subnets/action",
                ]
              + name    = "Microsoft.Web/serverFarms"
            }
        }
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_subnet_nat_gateway_association.app_service[0] will be created
  + resource "azurerm_subnet_nat_gateway_association" "app_service" {
      + id             = (known after apply)
      + nat_gateway_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_subnet_network_security_group_association.web_app_service_infra_allow_frontdoor_inbound_only[0] will be created
  + resource "azurerm_subnet_network_security_group_association" "web_app_service_infra_allow_frontdoor_inbound_only" {
      + id                        = (known after apply)
      + network_security_group_id = (known after apply)
      + subnet_id                 = (known after apply)
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_subnet_route_table_association.web_app_service_infra_subnet[0] will be created
  + resource "azurerm_subnet_route_table_association" "web_app_service_infra_subnet" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_virtual_network.default[0] will be created
  + resource "azurerm_virtual_network" "default" {
      + address_space       = [
          + "10.0.0.0/16",
        ]
      + dns_servers         = (known after apply)
      + guid                = (known after apply)
      + id                  = (known after apply)
      + location            = "westeurope"
      + name                = "find-a-tp-pr-398-default"
      + resource_group_name = "s177d01-ntp-pr-398"
      + subnet              = (known after apply)
      + tags                = {
          + "Environment"      = "pr-398"
          + "Product"          = "National Tutoring Programme"
          + "Service Offering" = "National Tutoring Programme"
        }
    }

Plan: 53 to add, 0 to change, 0 to destroy.
```
</details>